#task 1
student_grades_9a = {
    "Олександр Іванович Петров": 85,
    "Марія Сергіївна Іванова": 90,
    "Дмитро Олександрович Сидоров": 78
}

student_grades_9b = {
    "Катерина Петрівна Коваленко": 88,
    "Іван Дмитрович Кузьменко": 92,
    "Ольга Вікторівна Литвиненко": 80
}

combined_student_grades = student_grades_9a.copy()
combined_student_grades.update(student_grades_9b)

print("Об'єднаний словник з інформацією про успішність всіх учнів 9-х класів:")
print(combined_student_grades)

#task2
import re

text = """
Технології розвиваються стрімко. Кожен день ми спостерігаємо нові досягнення в науці та техніці. Комп'ютери стають все потужнішими, а програмне забезпечення – складнішим. Проте, разом з цими досягненнями зростає і потреба в нових спеціалістах, здатних працювати з сучасними технологіями.
Важливо пам'ятати, що розвиток технологій впливає не лише на виробництво, але й на повсякденне життя людей. Смартфони, комп'ютери, розумні будинки, інтернет речей – все це робить наше життя зручнішим і ефективнішим. Технології змінюють наше життя кожного дня.
Однак, не слід забувати про кібербезпеку. Захист даних стає все важливішим питанням, адже зростання обсягу цифрової інформації вимагає надійних рішень для її захисту. Розробка нових методів шифрування та аутентифікації – ключ до безпеки в цифровому світі. Технології безпеки постійно розвиваються.
Таким чином, можна сказати, що технологічний прогрес має свої переваги та виклики.
"""
text = text.lower()

text = re.sub(r'[^\w\s]', '', text)

words = text.split()

unique_words = set(words)

unique_word_count = len(unique_words)

print(f"Кількість різних слів у тексті: {unique_word_count}")

#task3
letters = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

letters_C_to_G = letters[2:7]
print("Літери від C до G включно:", letters_C_to_G)

every_second_letter = letters[::2]
print("Кожна друга літера, починаючи з A:", every_second_letter)

letters_Z_to_Q_reverse = letters[25:16:-1]
print("Літери від Z до Q у зворотному порядку:", letters_Z_to_Q_reverse)

first_three_letters = letters[:3]
print("Перші 3 літери алфавіту:", first_three_letters)

